app/controllers/stories_controller.rb

SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
---
  def show
    @story = Story.find(params[:id])

INSERT INTO `stories` (`name`, `narrative`, `created_at`, `updated_at`, `priority`, `estimate`) VALUES('Test', 'A', '2011-07-22 13:10:31', '2011-07-22 13:10:31', 1, 1)
---
  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save